
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 13 to add, 3 to change, 6 to destroy.</code></pre>

* Create
  * azurerm_media_content_key_policy.ams_default_policy
  * module.finalsa_storage_account.time_rotating.rotate
  * module.finalsa_storage_account_backup[0].time_rotating.rotate
  * module.ingestsa_storage_account.time_rotating.rotate
  * module.ingestsa_storage_account_backup[0].time_rotating.rotate
  * module.sa_storage_account.time_rotating.rotate
  * module.sa_storage_account_backup[0].time_rotating.rotate
* Update
  * azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
* Replace
  * module.finalsa_storage_account.time_static.pim_expiry
  * module.finalsa_storage_account_backup[0].time_static.pim_expiry
  * module.ingestsa_storage_account.time_static.pim_expiry
  * module.ingestsa_storage_account_backup[0].time_static.pim_expiry
  * module.sa_storage_account.time_static.pim_expiry
  * module.sa_storage_account_backup[0].time_static.pim_expiry


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_media_content_key_policy.ams_default_policy will be created
  + resource "azurerm_media_content_key_policy" "ams_default_policy" {
      + description                 = "PRE Content Key Policy"
      + id                          = (known after apply)
      + media_services_account_name = "preamsprod"
      + name                        = "PolicyWithClearKeyOptionAndJwtTokenRestriction"
      + resource_group_name         = "pre-prod"

      + policy_option {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # azurerm_monitor_metric_alert.storage_ingest_alert_capacity[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_ingest_alert_capacity" {
        id                       = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Insights/metricAlerts/used_capacity"
        name                     = "used_capacity"
      ~ scopes                   = [
          - "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod",
          + "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod",
        ]
        tags                     = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/prefinalsaprod"
        name                               = "prefinalsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "20.50.108.242",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.finalsa_storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.finalsa_storage_account.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 10 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2024-11-10T09:23:59Z" -> (known after apply)
      ~ minute  = 23 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-10T09:23:59Z" -> (known after apply) # forces replacement
      ~ second  = 59 -> (known after apply)
      ~ unix    = 1731230639 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # module.finalsa_storage_account_backup[0].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.finalsa_storage_account_backup[0].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 10 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2024-11-10T09:23:59Z" -> (known after apply)
      ~ minute  = 23 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-10T09:23:59Z" -> (known after apply) # forces replacement
      ~ second  = 59 -> (known after apply)
      ~ unix    = 1731230639 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/pre-prod/providers/Microsoft.Storage/storageAccounts/preingestsaprod"
        name                               = "preingestsaprod"
        tags                               = {
            "application"         = "pre-recorded-evidence"
            "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
            "environment"         = "production"
            "managedBy"           = "Pre Recorded Evidence"
        }
        # (97 unchanged attributes hidden)

      ~ blob_properties {
            # (5 unchanged attributes hidden)

          ~ delete_retention_policy {
              ~ days                     = 365 -> 7
                # (1 unchanged attribute hidden)
            }

            # (2 unchanged blocks hidden)
        }

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (2 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.ingestsa_storage_account.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 10 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2024-11-10T09:23:59Z" -> (known after apply)
      ~ minute  = 23 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-10T09:23:59Z" -> (known after apply) # forces replacement
      ~ second  = 59 -> (known after apply)
      ~ unix    = 1731230639 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # module.ingestsa_storage_account_backup[0].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.ingestsa_storage_account_backup[0].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 10 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2024-11-10T09:23:59Z" -> (known after apply)
      ~ minute  = 23 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-10T09:23:59Z" -> (known after apply) # forces replacement
      ~ second  = 59 -> (known after apply)
      ~ unix    = 1731230639 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # module.sa_storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sa_storage_account.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 10 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2024-11-10T09:23:59Z" -> (known after apply)
      ~ minute  = 23 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-10T09:23:59Z" -> (known after apply) # forces replacement
      ~ second  = 59 -> (known after apply)
      ~ unix    = 1731230639 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # module.sa_storage_account_backup[0].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.sa_storage_account_backup[0].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 10 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2024-11-10T09:23:59Z" -> (known after apply)
      ~ minute  = 23 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-10T09:23:59Z" -> (known after apply) # forces replacement
      ~ second  = 59 -> (known after apply)
      ~ unix    = 1731230639 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

Plan: 13 to add, 3 to change, 6 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.finalsa_storage_account.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-16T09:23:59Z"
      - rotation_rfc3339 = "2024-11-10T09:23:59Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.finalsa_storage_account_backup[0].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-16T09:23:59Z"
      - rotation_rfc3339 = "2024-11-10T09:23:59Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.ingestsa_storage_account.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-16T09:23:59Z"
      - rotation_rfc3339 = "2024-11-10T09:23:59Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.ingestsa_storage_account_backup[0].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-16T09:23:59Z"
      - rotation_rfc3339 = "2024-11-10T09:23:59Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.sa_storage_account.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-16T09:23:59Z"
      - rotation_rfc3339 = "2024-11-10T09:23:59Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.sa_storage_account_backup[0].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-16T09:23:59Z"
      - rotation_rfc3339 = "2024-11-10T09:23:59Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":926,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->